Repository: kiki2010/inundacionesRiverStream2025
Catalog: lib/l10n/intl_*.arb
Languages: es, ja

source: Hello
es: Hola
ja: こんにちは

source: Change Language
es: Cambiar Idioma
ja: 言語を変更

source: Post
ja: 投稿

source: Map
es: Mapa
ja: 地図

source: Risk
es: Predicción
ja: リスク

source: Simulate
es: Simulación
ja: シミュレート

source: Setting
es: Configuración
ja: 設定

# postScreen
source: Posting screen
es: Pantalla de Post
ja: 投稿画面

source: Image not selected
es: Imagen no seleccionada
ja: 画像が選択されていません

# errorhasocured
source: An error has occurred
ja: エラーが発生しました

# locationisturnedoff
source: Location services are turned off.
es: Los servicios de ubicación están desactivados.
ja: 位置情報サービスがオフになっています。

# locationdenied
source: Location authorization denied.
es: Autorización de ubicación denegada.
ja: 位置情報の許可が拒否されました。

# locationpermissionspermanently
source: Location permissions have been permanently denied. Please allow it from the settings.
es: Los permisos de ubicación se han denegado de forma permanente. Habilítelos desde la configuración.
ja: 位置情報の許可が恒久的に拒否されました。設定から許可してください。

# pleaseselectimage
source: Please select an image
es: Por favor seleccione una imagen
ja: 画像を選択してください

# submissioncomplete
source: Submission is complete!
es: ¡El post se a subido correctamente!
ja: 送信が完了しました！

source: Date
es: Fecha
ja: 日付

# riverPostScreen
source: River
es: Río
ja: 川

# riverSelectorPostScreen
source: Select a river
es: Seleccione un río
ja: 川を選択

# imageSelectorPostScreen
source: Image
es: Imagen
ja: 画像

# commentSelectorPostScreen
source: Comment
es: Comentario
ja: コメント

# writecommentSelectorPostScreen
source: Write a comment
es: Escribe un comentario
ja: コメントを書く

# postPostScreen
source: Post
es: Publicar
ja: 投稿

source: Map Screen
es: Pantalla de Mapa
ja: 地図画面

# moreInfo
source: More Information
es: Más Información
ja: 詳細情報

# imageCouldntbeloaded
source: Image could not be loaded
es: No se pudo cargar la imagen
ja: 画像を読み込めませんでした

# dateandtime
source: Date and Time {date}
es: Día y Hora {date}
ja: 日付と時間 {date}

# commentMapScreen
source: Comment {comment}
es: Comentario {comment}
ja: コメント {comment}

# closeMapScreen
source: Close
es: Cerrar
ja: 閉じる

# riskScreen
source: Flood Risk Screen
es: Pronosticos de Escurrimientos
ja: 洪水リスク画面

source: User Location
es: Tu ubicación
ja: ユーザーの位置

# riskRiskScreen
source: Risk {risk}
es: Riesgo {risk}
ja: リスク {risk}

source: Low
es: Bajo
ja: 低

source: Medium
es: Medio
ja: 中

source: High
es: Alto
ja: 高

# DEFAULT
source: Unknown
es: Desconocido
ja: 不明

# country
source: Country: {country}
es: País: {country}
ja: 国: {country}

# precipation
source: Precipation: {precipitationTotal}
es: Precipitaciones: {precipitationTotal}
ja: 降水量: {precipitationTotal}

# precipitationIntensity
source: Precipitation Intensity: {precipitationIntensity}
es: Intensidad de precipitación: {precipitationIntensity}
ja: 降水強度: {precipitationIntensity}

# humidity
source: Humidity: {humidity}
es: Humedad: {humidity}
ja: 湿度: {humidity}

# temperature
source: Temperature: {temperature}
es: Temperatura: {temperature}
ja: 気温: {temperature}

# noStationData
source: No station data available
es: Hay datos disponibles
ja: 利用可能な観測所データがありません

# precipitationProbability
source: Precipation: {precipitacionProbability}
es: Precipitaciones: {precipitacionProbability}
ja: 降水確率: {precipitacionProbability}

# firstSelectaRiver
source: First you need to select at least 1 river
es: Primero necesitas seleccionar un río
ja: まず少なくとも1つの川を選択してください

source: No Name
ja: 名前なし

# noForecastData
source: No forecast data available
es: No hay datos de pronostico disponibles
ja: 予測データがありません

source: Simulation Screen
es: Pantalla de simulación
ja: シミュレーション画面

source: Waiting for input...
es: Esperando Input...
ja: 入力待ち...

# noImgSelected
source: No image selected.
es: No hay ninguna imagen seleccionada.
ja: 画像が選択されていません。

# UploadingImg
source: Uploading image...
es: Subiendo imagen...
ja: 画像をアップロード中...

# UploadedImgUrl
source: Uploaded image URL: {uploadedUrl}
es: URL de la imagen cargada: {uploadedUrl}
ja: アップロードされた画像URL: {uploadedUrl}

# pleaseSelectOne
source: Please select only one option.
es: Seleccione sólo una opción.
ja: 1つだけ選択してください。

# sendingtoDreamMachine
source: Sending request to Dream Machine...
es: Enviando solicitud a Dream Machine...
ja: Dream Machineにリクエストを送信中...

# generationStarted
source: Video generation started. ID: {generationId}
es: Se inició la generación del video. ID: {generationId}
ja: ビデオ生成開始。ID: {generationId}

# errorGeneration
source: Error starting generation: {errorMsg}
es: Error al iniciar la generación: {errorMsg}
ja: 生成開始エラー: {errorMsg}

# errortype
source: Upload or generation error: {e}
es: Error de subida o generación: {e}
ja: アップロードまたは生成エラー: {e}

# requestVideo
source: Requesting extended video...
es: Solicito video ampliado...
ja: 拡張ビデオをリクエスト中...

# videoGenerationStarted
source: Extended video generation started. ID: {newId}
es: Se inició la generación de videos extendidos. ID: {newId}
ja: 拡張ビデオ生成開始。ID: {newId}

# errorExtendingVideo
source: Error extending video: {errorMsg}
es: Error al extender el video: {errorMsg}
ja: ビデオ拡張エラー: {errorMsg}

# errortypeextendingVideo
source: Error while extending video: {e}
es: Error al extender el video: {e}
ja: ビデオ拡張中のエラー: {e}

# generatingstate
source: Generating... Current state {state}
es: Generando... Estado actual {estado}
ja: 生成中... 現在の状態 {state}

source: Video ready! Playing...
es: ¡El vídeo está listo! Reproduciendo...
ja: ビデオが準備完了！再生中...

# errorretrievingUrl
source: Error retrieving video URL. Retrying...
es: Error al recuperar la URL del video. Reintentando...
ja: ビデオURLの取得エラー。再試行中...

# readybutnotfound
source: Completed, but no video URL found. Retrying...
es: Se completó, pero no se encontró la URL del video. Lo estoy intentando nuevamente...
ja: 完了しましたが、ビデオURLが見つかりません。再試行中...

# videogenerationFailed
source: Video generation failed: {failReason}
es: Error en la generación del video: {failReason}
ja: ビデオ生成に失敗しました: {failReason}

# erroeCheckingStatus
source: Error checking status (retrying...)
es: Error al comprobar el estado (reintentando...)
ja: ステータス確認エラー（再試行中...）

# generationTimeOut
source: Generation timed out. Please try again.
es: Se agotó el tiempo de generación. Inténtalo de nuevo.
ja: 生成がタイムアウトしました。もう一度お試しください。

source: House
es: Casa
ja: 家

# riverSimulationScreen
source: River
es: Río
ja: 川

# videoLoading
source: Video is loading...
es: El vídeo se está cargando...
ja: ビデオを読み込み中...

# pleaseSelectRiverorHouse
source: Please select either House or River.
es: Por favor seleccione Casa o Río.
ja: 家または川のいずれかを選択してください。

# pleaseSelectImage
source: Please select an image first.
es: Seleccione una imagen primero.
ja: 最初に画像を選択してください。

source: Generate
es: Generar
ja: 生成

# noIDFound
source: No generation ID found.
es: No se encontró ningún ID de generación.
ja: 生成IDが見つかりません。

source: Extend Generate
es: Extender Video
ja: 拡張生成

# settings
source: Setting
es: Configuración
ja: 設定

# buttonSettingSelectRiver
source: Select Rivers
es: Seleccionar Ríos
ja: 川を選択

source: Language
es: Lenguaje
ja: 言語

source: Notifications
es: Notificaiones
ja: 通知

# advicetext
source: Here are some sites to learn more about flooding:
es: A continuación se muestran algunos sitios donde puede obtener más información sobre las inundaciones:
ja: 洪水についてさらに詳しく知るには、次のサイトをご覧ください。

source: Flood Safety
es: Seguridad contra inundaciones
ja: 洪水に対する安全

source: During a Flood
es: Durante una inundación
ja: 洪水の間

# addNew
source: Add New River
es: Añadir nuevo río
ja: 新しい川を追加

# nameRiver
source: Name of the River
es: Nombre del río
ja: 川の名前

# plsAddRiverName
source: Please add the name of the river
es: Añadir el nombre del río
ja: 川の名前を追加してください

# stateoProvince
source: State/Province
es: Estado/Provincia
ja: 州/県

# plsAddStateProvince
source: Please add state/province
es: Añadir estado/provincia
ja: 州/県を追加してください

# countryform
source: Country
es: País
ja: 国

# plsAddcountry
source: Please add country
es: Añadir país
ja: 国を追加してください

source: Latitude
es: Latitud
ja: 緯度

# plsAddLatitude
source: Please enter a valid latitude
es: Introducir una latitud válida
ja: 有効な緯度を入力してください

source: Length
es: Longitud
ja: 長さ

# plsAddLenght
source: Please enter a valid Length
es: Introducir una longitud válida
ja: 有効な長さを入力してください

# riverAdded
source: River added successfully
es: Río añadido correctamente
ja: 川が正常に追加されました

# errorAddingRiver
source: Error adding river: {e}
es: Error al añadir el río: {e}
ja: 川の追加中にエラーが発生しました: {e}

source: Save
es: Guardar
ja: 保存

# notification
source: ⚠️Warning: HIGH Risk⚠️
es: Advertencia: Riego ALTO⚠️

# description
source: Pay attention to the recommendations of local authorities
es: Preste atención a las recomendaciones de las autoridades locales.
